; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-5-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-2 - location
	p0-5 - location
	p0-6 - location
	p1-0 - location
	p1-9 - location
	p2-9 - location
	p3-2 - location
	p4-3 - location
	p4-7 - location
	p4-8 - location
	p5-7 - location
	p5-9 - location
	p5-10 - location
	p6-1 - location
	p6-2 - location
	p8-9 - location
	p8-10 - location
	p9-4 - location
	p9-6 - location
	p10-0 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s4)
	(at driver3 s10)
	(at driver4 s8)
	(at driver5 s3)
	(at truck1 s9)
	(empty truck1)
	(at truck2 s9)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s10)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s4)
	(at package2 s5)
	(at package3 s7)
	(at package4 s10)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 62)
	(= (time-to-walk p0-2 s0) 62)
	(= (time-to-walk s2 p0-2) 67)
	(= (time-to-walk p0-2 s2) 67)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 17)
	(= (time-to-walk p0-5 s0) 17)
	(= (time-to-walk s5 p0-5) 20)
	(= (time-to-walk p0-5 s5) 20)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 51)
	(= (time-to-walk p0-6 s0) 51)
	(= (time-to-walk s6 p0-6) 24)
	(= (time-to-walk p0-6 s6) 24)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 29)
	(= (time-to-walk p1-0 s1) 29)
	(= (time-to-walk s0 p1-0) 38)
	(= (time-to-walk p1-0 s0) 38)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(= (time-to-walk s1 p1-9) 12)
	(= (time-to-walk p1-9 s1) 12)
	(= (time-to-walk s9 p1-9) 30)
	(= (time-to-walk p1-9 s9) 30)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(= (time-to-walk s2 p2-9) 56)
	(= (time-to-walk p2-9 s2) 56)
	(= (time-to-walk s9 p2-9) 35)
	(= (time-to-walk p2-9 s9) 35)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 76)
	(= (time-to-walk p3-2 s3) 76)
	(= (time-to-walk s2 p3-2) 51)
	(= (time-to-walk p3-2 s2) 51)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 24)
	(= (time-to-walk p4-3 s4) 24)
	(= (time-to-walk s3 p4-3) 50)
	(= (time-to-walk p4-3 s3) 50)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 83)
	(= (time-to-walk p4-7 s4) 83)
	(= (time-to-walk s7 p4-7) 13)
	(= (time-to-walk p4-7 s7) 13)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 55)
	(= (time-to-walk p4-8 s4) 55)
	(= (time-to-walk s8 p4-8) 21)
	(= (time-to-walk p4-8 s8) 21)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 38)
	(= (time-to-walk p5-7 s5) 38)
	(= (time-to-walk s7 p5-7) 55)
	(= (time-to-walk p5-7 s7) 55)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(= (time-to-walk s5 p5-9) 74)
	(= (time-to-walk p5-9 s5) 74)
	(= (time-to-walk s9 p5-9) 2)
	(= (time-to-walk p5-9 s9) 2)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(= (time-to-walk s5 p5-10) 53)
	(= (time-to-walk p5-10 s5) 53)
	(= (time-to-walk s10 p5-10) 44)
	(= (time-to-walk p5-10 s10) 44)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 60)
	(= (time-to-walk p6-1 s6) 60)
	(= (time-to-walk s1 p6-1) 46)
	(= (time-to-walk p6-1 s1) 46)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 41)
	(= (time-to-walk p6-2 s6) 41)
	(= (time-to-walk s2 p6-2) 99)
	(= (time-to-walk p6-2 s2) 99)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 71)
	(= (time-to-walk p8-9 s8) 71)
	(= (time-to-walk s9 p8-9) 2)
	(= (time-to-walk p8-9 s9) 2)
	(path s8 p8-10)
	(path p8-10 s8)
	(path s10 p8-10)
	(path p8-10 s10)
	(= (time-to-walk s8 p8-10) 65)
	(= (time-to-walk p8-10 s8) 65)
	(= (time-to-walk s10 p8-10) 88)
	(= (time-to-walk p8-10 s10) 88)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(= (time-to-walk s9 p9-4) 21)
	(= (time-to-walk p9-4 s9) 21)
	(= (time-to-walk s4 p9-4) 16)
	(= (time-to-walk p9-4 s4) 16)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(= (time-to-walk s9 p9-6) 12)
	(= (time-to-walk p9-6 s9) 12)
	(= (time-to-walk s6 p9-6) 50)
	(= (time-to-walk p9-6 s6) 50)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(= (time-to-walk s10 p10-0) 53)
	(= (time-to-walk p10-0 s10) 53)
	(= (time-to-walk s0 p10-0) 23)
	(= (time-to-walk p10-0 s0) 23)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 79)
	(= (time-to-drive s3 s0) 79)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 9)
	(= (time-to-drive s4 s0) 9)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 58)
	(= (time-to-drive s0 s1) 58)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 54)
	(= (time-to-drive s9 s1) 54)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 60)
	(= (time-to-drive s0 s2) 60)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 82)
	(= (time-to-drive s9 s3) 82)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 4)
	(= (time-to-drive s3 s4) 4)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 42)
	(= (time-to-drive s5 s4) 42)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 94)
	(= (time-to-drive s10 s4) 94)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 59)
	(= (time-to-drive s3 s5) 59)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 62)
	(= (time-to-drive s7 s5) 62)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 31)
	(= (time-to-drive s8 s5) 31)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 14)
	(= (time-to-drive s10 s5) 14)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 35)
	(= (time-to-drive s0 s6) 35)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 33)
	(= (time-to-drive s1 s6) 33)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 66)
	(= (time-to-drive s10 s6) 66)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 79)
	(= (time-to-drive s0 s7) 79)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 92)
	(= (time-to-drive s3 s7) 92)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 12)
	(= (time-to-drive s4 s7) 12)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 19)
	(= (time-to-drive s8 s7) 19)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 90)
	(= (time-to-drive s9 s7) 90)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 82)
	(= (time-to-drive s0 s8) 82)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 21)
	(= (time-to-drive s3 s8) 21)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 55)
	(= (time-to-drive s4 s8) 55)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 70)
	(= (time-to-drive s6 s8) 70)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 41)
	(= (time-to-drive s2 s9) 41)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 71)
	(= (time-to-drive s9 s10) 71)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver4 s3)
	(at driver5 s10)
	(at truck3 s2)
	(at truck4 s9)
	(at package1 s2)
	(at package2 s7)
	(at package3 s6)
	(at package4 s4)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 4  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver5 truck5 s3)
   deleted: (at driver5 s3) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 1 of 8
2. (drive-truck truck5 s3 s5 driver5)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   changed: (driven) from 0 to 59
   goals met: 1 of 8
3. (board-truck driver3 truck4 s10)
   deleted: (at driver3 s10) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 1 of 8
4. (load-truck package2 truck5 s5)
   deleted: (at package2 s5)
   added: (in package2 truck5)
   goals met: 1 of 8
5. (load-truck package4 truck4 s10)
   deleted: (at package4 s10)
   added: (in package4 truck4)
   goals met: 1 of 8
6. (drive-truck truck5 s5 s7 driver5)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   changed: (driven) from 59 to 121
   goals met: 1 of 8
7. (unload-truck package2 truck5 s7)
   deleted: (in package2 truck5)
   added: (at package2 s7)
   goals met: 2 of 8
8. (load-truck package3 truck5 s7)
   deleted: (at package3 s7)
   added: (in package3 truck5)
   goals met: 2 of 8
9. (drive-truck truck5 s7 s8 driver5)
   deleted: (at truck5 s7)
   added: (at truck5 s8)
   changed: (driven) from 121 to 140
   goals met: 2 of 8
10. (drive-truck truck5 s8 s6 driver5)
   deleted: (at truck5 s8)
   added: (at truck5 s6)
   changed: (driven) from 140 to 210
   goals met: 2 of 8
11. (unload-truck package3 truck5 s6)
   deleted: (in package3 truck5)
   added: (at package3 s6)
   goals met: 3 of 8
12. (drive-truck truck5 s6 s10 driver5)
   deleted: (at truck5 s6)
   added: (at truck5 s10)
   changed: (driven) from 210 to 276
   goals met: 3 of 8
13. (disembark-truck driver5 truck5 s10)
   deleted: (driving driver5 truck5)
   added: (at driver5 s10) (empty truck5)
   goals met: 4 of 8
14. (drive-truck truck4 s10 s4 driver3)
   deleted: (at truck4 s10)
   added: (at truck4 s4)
   changed: (driven) from 276 to 370
   goals met: 4 of 8
15. (unload-truck package4 truck4 s4)
   deleted: (in package4 truck4)
   added: (at package4 s4)
   goals met: 5 of 8
16. (drive-truck truck4 s4 s10 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s10)
   changed: (driven) from 370 to 464
   goals met: 5 of 8
17. (walk driver4 s8 p4-8)
   deleted: (at driver4 s8)
   added: (at driver4 p4-8)
   changed: (walked) from 0 to 21
   goals met: 5 of 8
18. (walk driver4 p4-8 s4)
   deleted: (at driver4 p4-8)
   added: (at driver4 s4)
   changed: (walked) from 21 to 76
   goals met: 5 of 8
19. (walk driver4 s4 p4-3)
   deleted: (at driver4 s4)
   added: (at driver4 p4-3)
   changed: (walked) from 76 to 100
   goals met: 5 of 8
20. (walk driver4 p4-3 s3)
   deleted: (at driver4 p4-3)
   added: (at driver4 s3)
   changed: (walked) from 100 to 150
   goals met: 6 of 8
21. (drive-truck truck4 s10 s4 driver3)
   deleted: (at truck4 s10)
   added: (at truck4 s4)
   changed: (driven) from 464 to 558
   goals met: 6 of 8
22. (load-truck package1 truck4 s4)
   deleted: (at package1 s4)
   added: (in package1 truck4)
   goals met: 6 of 8
23. (drive-truck truck4 s4 s10 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s10)
   changed: (driven) from 558 to 652
   goals met: 6 of 8
24. (drive-truck truck4 s10 s9 driver3)
   deleted: (at truck4 s10)
   added: (at truck4 s9)
   changed: (driven) from 652 to 723
   goals met: 7 of 8
25. (drive-truck truck4 s9 s2 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s2)
   changed: (driven) from 723 to 764
   goals met: 6 of 8
26. (unload-truck package1 truck4 s2)
   deleted: (in package1 truck4)
   added: (at package1 s2)
   goals met: 7 of 8
27. (drive-truck truck4 s2 s9 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s9)
   changed: (driven) from 764 to 805
   goals met: 8 of 8
